// სულ არის კოდის წერის სამი პრინციპი: 1)DRY 2)KISS 3)YAGNI

//DRY (Don't Repeaat Yourself) ანუ არ უნდა გვქონდეს ერთნაირი კოდები დაწერილი. ყველა ერთნაირი კოდი ერთ ფუნქციაში ან ფაილში უნდა იყოს და სადაც გვინდა მერე იქ გამოვიყენოთ.
//KISS (Keep It Simple, Stupid) ანუ რაც შეიძლება მარტივად უნდა დავწეროთ ყველაფერი ჩახლართვის გარეშე. უნდა იყოს მარტივად გასაგები, ცვლადებს მარტივად მისახვედრი სახელები უნდა ქონდეს
//კომპლექსური კოდი მარტვ task-ებად უნდა დავყოთ
//YAGNI (You Ain't Gonnda Need It) ანუ დავწეროთ კოდი რაც ამ მომენტში გვჭირდება და არა ისეთი რომელიც მომავალში გამოგადგება

//--------------- BEST REACT FEATURE  (Real DOM vs virtual DOM)
// რეაქტი იყენებს ვირტუალურ დომს. ხოლო ბრაუზერში არის რეალური დომი. რეაქტის ვირტუალური დომი ადარებს რეალურ დომს და რა ცვლილებებიც არის იმას ანაცვლებს. რეაქტის კოდი არის ჯავასკრიპტით დაწერილი
// ანუ საბოლოოდ თვითონ გარდაიქმნება ჯავასკრიპტის ენაზე

//------------------npm Packages
//npm Packages არის გამზადებული კოდი რომელიც შეგიძლია ჩაიწერო და გამოიყენო. საიტის სახელი npmjs.com
// node_modules -ში ყენდება packages
